0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    floor
    {
	    type     	  	fixedFluxPressure;
    }

    heatedFloor
    {
      type          fixedFluxPressure;
    }

    ceiling
    {
	    type 		      fixedFluxPressure;
    }

    wall
    {
      type          fixedFluxPressure;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
