constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=32;scalar=64";
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    floor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1225;
        startFace       124950;
    }
    ceiling
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1225;
        startFace       126175;
    }
    patch0_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1225;
        startFace       127400;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  patch0_half1;
    }
    patch0_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1225;
        startFace       128625;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  patch0_half0;
    }
    patch1_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1225;
        startFace       129850;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  patch1_half1;
    }
    patch1_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1225;
        startFace       131075;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  patch1_half0;
    }
)

// ************************************************************************* //
