system/blockMeshDictCyclicBox
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;
num 0.3536;
negNum -0.3535;
h 0.1;

vertices
(

    ($negNum $h $negNum)
    ($num $h $negNum)
    ($num $h $num)
    ($negNum $h $num)
    ($negNum 0 $negNum)
    ($num 0 $negNum)
    ($num 0 $num)
    ($negNum 0 $num)
   
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (25 25 25) simpleGrading (1 1 1)
);

edges
(


);

boundary
(
    floor
    {
        type wall;
        faces
        (
            (7 6 5 4)
        );
    }

    ceiling
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }

    patch0_half0
    {
	type cyclic;
	neighbourPatch patch0_half1;
	faces
	(
	    (4 5 1 0)
	);
    }

    patch0_half1
    {
	type cyclic;
	neighbourPatch patch0_half0;
	faces
	(
	    (3 2 6 7)
	);
    }

    patch1_half0
    {
	type cyclic;
	neighbourPatch patch1_half1;
	faces
	(
	    (2 6 5 1)
	);
    }

    patch1_half1
    {
	type cyclic;
	neighbourPatch patch1_half0;
	faces
	(
	    (7 4 0 3)
	);
    }
);
mergePatchPairs
(
);

// ************************************************************************* //
